app/controllers/books_controller.rb

  def index
     #render :file => 'app/views/upload/uploadfile.html.erb'
    #redirect_to(:action => "index") and return
    @books = Book.all
---
SELECT `books`.* FROM `books`

  def show
    @book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

  def edit
    @book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 4 LIMIT 1

  def create
    @book = Book.new(params[:book])
    respond_to do |format|
      if @book.save
---
INSERT INTO `books` (`Content`, `File`, `Image`, `Reference`, `Tag`, `Title`, `created_at`, `updated_at`) VALUES ('', NULL, NULL, '', 'ruby', '', '2014-02-10 10:02:31', '2014-02-10 10:02:31')

  def update
    @book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 4 LIMIT 1

  def destroy
    @book = Book.find(params[:id])
    @book.destroy
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 4 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 4