app/controllers/employees_controller.rb

SELECT `employees`.* FROM `employees`
---
  def index
    @employees = Employee.all

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
---
  def show
    @employee = Employee.find(params[:id])

INSERT INTO `employees` (`chatid`, `created_at`, `empid`, `empname`, `ordernumber`, `updated_at`) VALUES (0, '2014-02-05 10:04:35', 0, 'ggg', 0, '2014-02-05 10:04:35')
---
  def create
    @employee = Employee.new(params[:employee])

    respond_to do |format|
      if @employee.save